Revit 2027 API
ProgressChangedEventArgs.Stage Property
 The current stage of the progress bar
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProgressStage Stage { get; }
Public ReadOnly Property Stage As ProgressStage
	Get
public:
property ProgressStage Stage {
	ProgressStage get ();
}
member Stage : ProgressStage with get
Property Value
ProgressStage
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace